Функция АдресСервераДляЗапросов(ВыбранныйСерверLLM) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ВыбранныйСерверLLM);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СерверыLLM.Сервер КАК Сервер,
	|	СерверыLLM.Порт КАК Порт
	|ИЗ
	|	Справочник.СерверыLLM КАК СерверыLLM
	|ГДЕ
	|	СерверыLLM.Ссылка = &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат СтрШаблон("%1:%2", Выборка.Сервер, XMLСтрока(Выборка.Порт));
		
		
	КонецЕсли;
	
	ВызватьИсключение "Не смог сформировать строку подключения к серверу";

КонецФункции