
Функция ХромаСервер() Экспорт
	
	Возврат "http://192.168.0.104:8800";
	
КонецФункции                 

Функция ВерсияСервера() Экспорт
	
	Метод = "/api/v2/version";
	Ответ = КоннекторHTTP.Get(ХромаСервер() + Метод);
	Возврат КоннекторHTTP.КакТекст(Ответ, КодировкаТекста.UTF8);	
КонецФункции

Функция СерверДоступен() Экспорт
	Метод = "/api/v2/heartbeat";
	Ответ = КоннекторHTTP.Get(ХромаСервер() + Метод);
	Возврат КоннекторHTTP.КакТекст(Ответ, КодировкаТекста.UTF8);	
КонецФункции

Функция ДобавитьПространство(ИмяПространства) Экспорт
	
	Метод = "/api/v2/tenants";              
	ПараметрыЗапроса = Новый Структура;
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json");
	ПараметрыЗапроса.Вставить("Заголовки", Заголовки);
	
	ТелоЗапроса = Новый Структура;
  	ТелоЗапроса.Вставить("name", ИмяПространства);
	
	Ответ = КоннекторHTTP.Post(ХромаСервер() + Метод, ЗаписатьЗначениеJSON(ТелоЗапроса), ПараметрыЗапроса);
	
	Возврат Новый Структура("КодОтвета, Ответ", Ответ.КодСостояния, КоннекторHTTP.КакТекст(Ответ));

КонецФункции

// /api/v2/tenants/{tenant}/databases
//создать базу
Функция ВыполнитьЗапрос(Параметры)

	Метод = "/api/v2/tenants/{tenant}/databases/{database_name}/collections/{collection_id}/query";
	Тип = "POST";    
	
	ТелоЗапроса = 
	"{
 | ""where"": {},
 | ""where_document"": {},
 | ""query_embeddings"": [
 |   ""string""
 | ],
 | ""n_results"": 10,
 | ""include"": [
 |   ""metadatas"",
 |   ""documents"",
 |   ""distances""
 | ]}";
КонецФункции                                                    

//  /api/v2/tenants/{tenant}/databases/{database_name}/collections    //GET Список коллекций

// /api/v2/tenants/{tenant}/databases/{database_name}/collections   //POST создать {
 // "name": "string",
 // "configuration": {},
 // "metadata": {},
 // "get_or_create": false
//}






