 
Функция ОтправитьЗапросСерверу(ТипЗапроса, Адрес, КонтекстРаботы) Экспорт

	Если ТипЗапроса = "GET" Тогда                     
		
		Ответ = GetЗапросКСерверу(Адрес, КонтекстРаботы);
		
	ИначеЕсли ТипЗапроса = "POST" Тогда
		
		Ответ = PostЗапросКСерверу(Адрес, КонтекстРаботы);
	Иначе
		ВызватьИсключение "Неподдерживаемый тип запросов";
		
	КонецЕсли;
		
    Возврат  КоннекторHTTP.КакТекст(Ответ, КодировкаТекста.UTF8);

КонецФункции    

Функция GetЗапросКСерверу(Адрес, Контекст) 
	
	Возврат КоннекторHTTP.Get(Адрес);
	
КонецФункции

Функция PostЗапросКСерверу(Адрес, Контекст)
	
	ПараметрыЗапроса = Новый Структура;
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json");
	ПараметрыЗапроса.Вставить("Заголовки", Заголовки);
	ПараметрыЗапроса.Вставить("Таймаут", 600);
	
	Возврат КоннекторHTTP.Post(Адрес, Контекст, ПараметрыЗапроса);	
	
КонецФункции